import { Helmet } from "react-helmet-async";
import { Box, Typography } from "@mui/material";

import Grid from "@mui/material/Unstable_Grid2";
import Info from "../components/common/Info";

const mainInfo = [
  { label: "نام", name: "آرش" },
  { label: "نام خانوادگی", name: "بهمنی" },
  { label: "سن", name: "24" },
  { label: "شهر من", name: "زنجان" },
];

const PersonalInfo = ({ helmetTitle }) => {
  const personalInfsoData = {
    intrested:
      "توی این دنیا چیزای زیادی نیست که دوستشون دارم اما خیلی کم هم نیستن! پیاده روی بخش جدا نشدنی از زندگی منه و به طبیعت‌گردی علاقه دارم. به ورزش کردن اهمیت میدم و سعی می‌کنم منظم باشگاه برم. رانندگی توی جاده‌های خلوت در دل طبیعت رو دوست دارم و عمیقا از یادگیری و مطالعات مربوط به زمنیه‌های کاریم لذت می‌برم. دوست دارم بعضی موقع‌ها برای خودم آشپزی کنم و غذاهای ساده درست کنم. بهتر بگم کلا به غذا علاقه دارم  به خصوص غذاهای ایرانی و ایتالیایی!وقت خالیم رو با فیلم و سریال‌های خارجی و کتاب پر می‌کنم. بعضی موقع‌ها هم با گپ‌های دوستانه و خانوادگی. راستی عاشق نوشتن و برنامه‌ریزی هستم و عادت دارم همه‌چیز رو مکتوب و آرشیو بندی کنم. از موسیقی‌های کلاسیک و پاپ اصیل ایرانی که نگم براتون چون اگه نباشه نه رانندگی بهم حال میده نه پیاده‌روی!دوست دارم پیشرفت کنم و باعث پیشرفت بقیه بشم و دوست دارم یاد بگیرم و یاد بدم. اگه کنجکاوی بدونی تایپ شخصیتیم چیه باید بهت بگم که بین INFJ و INTJ متغیره.",
    books:
      "بیشتر طرفدار ادبیات روسیه هستم هرچند سعی می‌کنم از هر سبک و فرهنگی کتاب خونده باشم. سبک‌های رئالیسم، سورئال و حماسی رو خیلی می‌پسندم و به جسته‌وگریخته شعر خوندن هم علاقه دارم به ویژه اشعار خیام. همیشه سعی می‌کنم کتاب‌های توسعه شخصی، کسب‌وکار و روانشناسی رو به صورت جدی در برنامه مطالعاتیم قرار بدم. ناگفته نمونه که به تاریخ و کتاب‌های تاریخی علاقه خاصی دارم. این پایین چندتا از کتابای مورد علاقمو بهتون معرفی و توصیه می‌کنم. صد سال تنهایی از گابریل گارسیا مارکوز جنایت و مکافات از فئودور داستایفسکی برادران کارامازوف از فئودور داستایفسکی مجموعه رمان‌های ارباب حلقه‌ها به‌ویژه فرزندان هورین از جی آر آر تالکین شکار گوسفند وحشی از هاروکی موراکامی باشگاه پنج صبحی‌ها از رابین شارما سنگفرش هر خیابان از طلاست از کیم وو چونگ هنر ظریف بی‌خیالی از مارک منسون شاهنامه فردوسی ترانه‌های خیام تمایز شغلی از ویلیام آرودا و کرستن دیکسن چشم عقاب از محسن هجری",
  };

  const personalInfoData = [
    {
      text: "توی این دنیا چیزای زیادی نیست که دوستشون دارم اما خیلی کم هم نیستن! پیاده روی بخش جدا نشدنی از زندگی منه و به طبیعت‌گردی علاقه دارم. به ورزش کردن اهمیت میدم و سعی می‌کنم منظم باشگاه برم. رانندگی توی جاده‌های خلوت در دل طبیعت رو دوست دارم و عمیقا از یادگیری و مطالعات مربوط به زمنیه‌های کاریم لذت می‌برم. دوست دارم بعضی موقع‌ها برای خودم آشپزی کنم و غذاهای ساده درست کنم. بهتر بگم کلا به غذا علاقه دارم  به خصوص غذاهای ایرانی و ایتالیایی!وقت خالیم رو با فیلم و سریال‌های خارجی و کتاب پر می‌کنم. بعضی موقع‌ها هم با گپ‌های دوستانه و خانوادگی. راستی عاشق نوشتن و برنامه‌ریزی هستم و عادت دارم همه‌چیز رو مکتوب و آرشیو بندی کنم. از موسیقی‌های کلاسیک و پاپ اصیل ایرانی که نگم براتون چون اگه نباشه نه رانندگی بهم حال میده نه پیاده‌روی!دوست دارم پیشرفت کنم و باعث پیشرفت بقیه بشم و دوست دارم یاد بگیرم و یاد بدم. اگه کنجکاوی بدونی تایپ شخصیتیم چیه باید بهت بگم که بین INFJ و INTJ متغیره.",
    },
    {
      text: "بیشتر طرفدار ادبیات روسیه هستم هرچند سعی می‌کنم از هر سبک و فرهنگی کتاب خونده باشم. سبک‌های رئالیسم، سورئال و حماسی رو خیلی می‌پسندم و به جسته‌وگریخته شعر خوندن هم علاقه دارم به ویژه اشعار خیام. همیشه سعی می‌کنم کتاب‌های توسعه شخصی، کسب‌وکار و روانشناسی رو به صورت جدی در برنامه مطالعاتیم قرار بدم. ناگفته نمونه که به تاریخ و کتاب‌های تاریخی علاقه خاصی دارم. این پایین چندتا از کتابای مورد علاقمو بهتون معرفی و توصیه می‌کنم.",
      booksList: [
        "صد سال تنهایی از گابریل گارسیا مارکوز ",
        "جنایت و مکافات از فئودور داستایفسکی",
        "برادران کارامازوف از فئودور داستایفسکی",
        "مجموعه رمان‌های ارباب حلقه‌ها به‌ویژه فرزندان هورین از جی آر آر تالکین",
        "شکار گوسفند وحشی از هاروکی موراکامی",
        "باشگاه پنج صبحی‌ها از رابین شارما",
        "سنگفرش هر خیابان از طلاست از کیم وو چونگ",
        "هنر ظریف بی‌خیالی از مارک منسون",
        "شاهنامه فردوسی",
        "ترانه‌های خیام",
        "تمایز شغلی از ویلیام آرودا و کرستن دیکسن",
        "چشم عقاب از محسن هجری",
      ],
    },
    {
      text: "شاید از روی کتاب‌هام ژانرهای مورد علاقم رو حدس زده باشی تا الان! جونم برات بگه که من به ژانرهای فانتزی حماسی، تاریخی، درام، علمی‌تخیلی و کارآگاهی علاقمندم . به صورت خیلی جدی هم طرفدار پر و پا قرص انیمیشنم😅. چندتا از فیلم و سریال‌های مورد علاقمو بهتون معرفی می‌کنم:",
      movies: [
        "سه‌گانه ارباب حلقه‌ها",
        "سه‌گانه ماتریکس (چهارمیش نههه)",
        "لئون حرفه‌ای (Leon The Professional)",
        "رهایی از شاوشنگ (The Shawshank Redemption)",
        "شوالیه تاریکی (The Dark Knight)",
        "میان‌ستاره‌ای (Interstellar)",
        "افسارگسیخته (Breaking bad)",
        "سه پادشاهی (Three kingdom)",
        "بازی تاج‌وتخت (Game Of Throns)",
        "وکیل وو خارق‌العاده (Extraordinary Attorney Woo)",
        "سریال Friends",
        "ماجراهای شرلوک هلمز (The Adventures of Sherlock Holmes)",
      ],
    },
  ];

  return (
    <Box
      sx={{
        height: "100%",
        width: "100%",
        direction: "ltr",
        overflowY: "scroll",
      }}
    >
      <Helmet>
        <title>{helmetTitle}</title>
      </Helmet>

      <Grid container sx={{ my: 4, mx: 2, mb: 6 }}>
        {mainInfo.map((info) => (
          <Info label={info.label} name={info.name} />
        ))}
      </Grid>

      <Box sx={{ m: 4 }}>
        <Typography color="white" variant="h3">
          علایق شخصی
        </Typography>
        <Typography
          color="white"
          variant="body2"
          sx={{ textAlign: "justify", m: 3 }}
        >
          {personalInfoData[0].text}
        </Typography>
      </Box>
      <Box sx={{ m: 4 }}>
        <Typography color="white" variant="h3">
          کتاب‌های مورد علاقه
        </Typography>
        <Typography
          color="white"
          variant="body2"
          sx={{ textAlign: "justify", m: 3 }}
        >
          {personalInfoData[1].text}
          <ul>
            {personalInfoData[1].booksList.map((book) => (
              <li>{book}</li>
            ))}
          </ul>
        </Typography>
      </Box>
      <Box sx={{ m: 4 }}>
        <Typography color="white" variant="h3">
          فیلم و سریال مورد علاقه
        </Typography>
        <Typography
          color="white"
          variant="body2"
          sx={{ textAlign: "justify", m: 3 }}
        >
          {personalInfoData[2].text}
          <ul>
            {personalInfoData[2].movies.map((book) => (
              <li>{book}</li>
            ))}
          </ul>
        </Typography>
      </Box>
    </Box>
  );
};

export default PersonalInfo;
